Enterprise_Serivces/Prod/Bronze4/CSLVisitedSitesService/result1/Iteration1/t6_RequestBody.txt

<?xml version="1.0" encoding="utf-8"?><soap:Envelope xmlns:soap="http://schemas.xmlsoap.org/soap/envelope/" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xmlns:xsd="http://www.w3.org/2001/XMLSchema" xmlns:wsa="http://schemas.xmlsoap.org/ws/2004/03/addressing"><soap:Header><wsa:Action>http://www.gamestop.com/services/csl/visitedsite/contracts/2010/05/IVisitedSiteService/LogSiteApproval</wsa:Action><wsa:MessageID>uuid:40312a7f-7c1a-4fea-8e6f-f6327ee33c79</wsa:MessageID><wsa:ReplyTo><wsa:Address>http://schemas.xmlsoap.org/ws/2004/03/addressing/role/anonymous</wsa:Address></wsa:ReplyTo><wsa:To>http://cslvisitedsitesserviceqa1.testgs.pvt/VisitedSiteService.svc</wsa:To></soap:Header><soap:Body><LogSiteApproval xmlns="http://www.gamestop.com/services/csl/visitedsite/contracts/2010/05"><request><MachineName xmlns="http://www.gamestop.com/services/core/contracts/2010/05">test</MachineName><AlwaysAllow xmlns="http://www.gamestop.com/services/csl/visitedsites/contracts/messages/2010/05">false</AlwaysAllow><OpenIDClaimedIdentifier xmlns="http://www.gamestop.com/services/csl/visitedsites/contracts/messages/2010/05">abcde</OpenIDClaimedIdentifier><Realm xmlns="http://www.gamestop.com/services/csl/visitedsites/contracts/messages/2010/05">0d979c3f-e848-4856-8ce7-f45d1722d9b1</Realm><UpdateUrl xsi:nil="true" xmlns="http://www.gamestop.com/services/csl/visitedsites/contracts/messages/2010/05" /></request></LogSiteApproval></soap:Body></soap:Envelope>